# coding = utf-8
# 光伏组件模型参数配置，配置详细内部参数

"""
配置格式：
module_type = {
    "Uoc_ref" : <开路电压标称值>,
    "Isc_ref" : <短路电流标称值>,
    "Rsh_ref" : <并联电阻标称值>,
    "Rs_ref" : <串联电阻标称值>,
    "Tref" : <标准参考温度值(K)：273.15+25>,
    "Sref" : <标准辐照度参考值(W/m²)：1000>,
    "Alpha" : <电流温度变化系数>,
    "beta" : <电压温度变化系数>,
    "Ns" : <组件中Cell个数>,
    "n" : <二极管理想因子>，
}
"""

default_type = {
    "Uoc_ref": 36.3,
    "Isc_ref": 7.84,
    "Rsh_ref": 313.3991,
    "Rs_ref": 0.39383,
    "Tref": 298.15,
    "Sref": 1000,
    "Alpha": 0.102,
    "beta": -0.36099,
    "Ns": 60,
    "n": 0.98117,
}
